Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.GetResults Method
 Get analysis results.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<AnalysisResult> GetResults(
	AnalysisResult.ObjectTypeEnum? objectType,
	int? objectId,
	AnalysisResult.ResultPositionEnum? position,
	Point point,
	AnalysisResult.ValueTypeEnum? valueType,
	bool sort
)
Public Shared Function GetResults (
	objectType As AnalysisResult.ObjectTypeEnum?,
	objectId As Integer?,
	position As AnalysisResult.ResultPositionEnum?,
	point As Point,
	valueType As AnalysisResult.ValueTypeEnum?,
	sort As Boolean
) As List(Of AnalysisResult)
Parameters
objectType
Type: System.Nullable<AnalysisResult.ObjectTypeEnum>
The object type.
objectId
Type: System.Nullable<Int32>
The object id or number (also object type must be given).
position
Type: System.Nullable<AnalysisResult.ResultPositionEnum>
The position.
point
Type: Tekla.Structures.Geometry3d.Point
The position point (when position is POSITION_BY_COORDINATES).
valueType
Type: System.Nullable<AnalysisResult.ValueTypeEnum>
The value type.
sort
Type: System.Boolean
True if values to be sorted.
Return Value
Type: List<AnalysisResult>
The results.
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace